app/controllers/articles_controller.rb

    def update
        @article = Article.find(params["id"])

        if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "World! edited"], ["updated_at", "2020-06-12 13:07:33.117791"], ["id", 1]]